huddddle/RecruitmentQuestion/mspm0-modules.syscfg
UART2.$name                            = "UART_BT";
UART2.peripheral.rxPin.$assign         = "PA9";
UART2.peripheral.txPin.$assign         = "PA8";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric4";

UART3.targetBaudRate                       = 115200;
UART3.$name                                = "UART_0";
UART3.enableFIFO                           = true;
UART3.txFifoThreshold                      = "DL_UART_TX_FIFO_LEVEL_1_4_EMPTY";
/*
 * 半满阈值使 FIFO 保留最后 1 字节：正常帧由 11 字节 DMA + 1 字节 FIFO 组成，
 * 短帧结束时 FIFO 中也有尾字节，因此 RX timeout 能可靠触发恢复。
 */
UART3.rxFifoThreshold                      = "DL_UART_RX_FIFO_LEVEL_1_2_FULL";
/* 15 个位时间内没有下一个字节时产生 RX timeout。 */
UART3.rxTimeoutValue                       = 15;
UART3.enabledInterrupts                    = ["DMA_DONE_RX","DMA_DONE_TX","EOT_DONE","RX_TIMEOUT_ERROR"];
UART3.enabledDMATXTriggers                 = "DL_UART_DMA_INTERRUPT_TX";
UART3.enabledDMARXTriggers                 = "DL_UART_DMA_INTERRUPT_RX";
UART3.peripheral.rxPin.$assign             = "PA25";
UART3.peripheral.txPin.$assign             = "PA26";
UART3.txPinConfig.direction                = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion      = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric10";
UART3.rxPinConfig.hideOutputInversion      = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric11";
UART3.DMA_CHANNEL_TX.$name                 = "DMA_CH1";
UART3.DMA_CHANNEL_TX.addressMode           = "b2f";
UART3.DMA_CHANNEL_TX.srcLength             = "BYTE";
UART3.DMA_CHANNEL_TX.dstLength             = "BYTE";
UART3.DMA_CHANNEL_TX.configureTransferSize = true;
UART3.DMA_CHANNEL_TX.transferSize          = 12;
UART3.DMA_CHANNEL_RX.srcLength             = "BYTE";
UART3.DMA_CHANNEL_RX.dstLength             = "BYTE";
UART3.DMA_CHANNEL_RX.configureTransferSize = true;
/* 12 字节帧的最后 1 字节留在 FIFO，由 UART 中断读取。 */
UART3.DMA_CHANNEL_RX.transferSize          = 11;
UART3.DMA_CHANNEL_RX.addressMode           = "f2b";
UART3.DMA_CHANNEL_RX.enableInterrupt       = true;
UART3.DMA_CHANNEL_RX.$name                 = "DMA_CH0";
UART3.DMA_CHANNEL_RX.peripheral.$assign    = "DMA_CH0";

UART4.$name                             = "MSPMotor";
UART4.targetBaudRate                    = 115200;
UART4.enableFIFO                        = true;
UART4.rxFifoThreshold                   = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART4.txFifoThreshold                   = "DL_UART_TX_FIFO_LEVEL_ONE_ENTRY";
UART4.enabledInterrupts                 = ["EOT_DONE","RX"];
UART4.enabledDMATXTriggers              = "DL_UART_DMA_INTERRUPT_TX";
UART4.peripheral.$assign                = "UART2";
UART4.peripheral.rxPin.$assign          = "PA24";
UART4.peripheral.txPin.$assign          = "PB17";
UART4.txPinConfig.direction             = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric13";
UART4.rxPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric14";
UART4.DMA_CHANNEL_TX.$name              = "MSPMotor_TX_DMA";
UART4.DMA_CHANNEL_TX.addressMode        = "b2f";
UART4.DMA_CHANNEL_TX.dstLength          = "BYTE";
UART4.DMA_CHANNEL_TX.srcLength          = "BYTE";
UART4.DMA_CHANNEL_TX.peripheral.$assign = "DMA_CH3";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution                = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution       = "PA20";
Board.peripheral.swdioPin.$suggestSolution       = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution     = "PB9";
GPIO1.associatedPins[1].pin.$suggestSolution     = "PB8";
GPIO2.associatedPins[0].pin.$suggestSolution     = "PB3";
GPIO2.associatedPins[1].pin.$suggestSolution     = "PB2";
GPIO2.associatedPins[2].pin.$suggestSolution     = "PA7";
GPIO2.associatedPins[3].pin.$suggestSolution     = "PB14";
GPIO3.associatedPins[0].pin.$suggestSolution     = "PB24";
GPIO3.associatedPins[1].pin.$suggestSolution     = "PB20";
GPIO3.associatedPins[2].pin.$suggestSolution     = "PB18";
GPIO3.associatedPins[3].pin.$suggestSolution     = "PB19";
GPIO3.associatedPins[4].pin.$suggestSolution     = "PA12";
GPIO3.associatedPins[6].pin.$suggestSolution     = "PB15";
GPIO3.associatedPins[7].pin.$suggestSolution     = "PA27";
GPIO4.associatedPins[0].pin.$suggestSolution     = "PB10";
GPIO5.associatedPins[0].pin.$suggestSolution     = "PB22";
GPIO7.associatedPins[0].pin.$suggestSolution     = "PB21";
GPIO7.associatedPins[1].pin.$suggestSolution     = "PA14";
GPIO8.associatedPins[0].pin.$suggestSolution     = "PB12";
GPIO8.associatedPins[1].pin.$suggestSolution     = "PB13";
GPIO9.associatedPins[0].pin.$suggestSolution     = "PB1";
I2C1.peripheral.$suggestSolution                 = "I2C1";
PWM3.peripheral.$suggestSolution                 = "TIMG8";
TIMER1.peripheral.$suggestSolution               = "TIMG0";
TIMER2.peripheral.$suggestSolution               = "TIMA0";
UART1.peripheral.$suggestSolution                = "UART0";
UART1.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH2";
UART2.peripheral.$suggestSolution                = "UART1";
UART3.peripheral.$suggestSolution                = "UART3";
UART3.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH1";
